import sass from "./DataProcessing.module.scss";

export const DataProcessing = () => {
	return (
		<main className={sass.dataProcessing}>
			<div className="container">
				<div className={sass.dataProcessingInner}>
					<p>
						Наш магазин зобов'язується дотримуватися положень Закону України "Про захист персональних даних" № 2297-VI від 01.06.2010 року та інших законодавчих актів, що регулюють відносини зі збору, зберігання, обробки, захисту та передачі персональних даних.
					</p>
					<p>
						Ми використовуємо персональні дані наших клієнтів тільки з метою надання послуг та доставки товарів. Персональні дані можуть включати інформацію про клієнтів, таку як ім'я, адресу електронної пошти, номер телефону та адресу доставки товару.
					</p>
					<p>
						Ми збираємо персональні дані виключно з дозволу клієнта та тільки в обсязі, необхідному для надання послуг та доставки товару. Ми зобов'язуємося не розголошувати персональні дані третім особам без дозволу власника даних, за винятком випадків, передбачених законодавством України.
					</p>
					<p>
						Ми вживаємо всіх можливих заходів для захисту персональних даних від несанкціонованого доступу, втрати, руйнування або пошкодження. Ми використовуємо різні технічні та організаційні заходи для забезпечення безпеки персональних даних наших клієнтів.
					</p>
					<p>
						Ми зберігаємо персональні дані лише протягом необхідного періоду для виконання мети їх збору. Після закінчення цього періоду ми видаляємо або анонімізуємо персональні дані відповідно до вимог законодавства України.
					</p>
					<p>
						Збір персональних даних
Ми збираємо такі персональні дані користувачів сайту:
ім'я, прізвище, по батькові;
номер телефону;
електронну пошту;
країну, область, місто;
адресу проживання;
поштовий індекс.
Використання персональних даних
Ми використовуємо персональні дані користувачів сайту виключно для зв'язку з клієнтом і доставки товару на вказану адресу.

Захист персональних даних
Ми забезпечуємо безпеку персональних даних користувачів відповідно до законодавства України та не розголошуємо їх третім особам.

Доступ до персональних даних
Доступ до персональних даних користувачів сайту мають лише працівники нашого магазину.

Використання персональних даних
Персональні дані користувачів використовуються тільки для надання наших послуг, описаних вище.

Якщо у вас є будь-які питання щодо обробки ваших персональних даних, будь ласка, зв'яжіться з нами за допомогою контактної інформації на сайті.
					</p>
				</div>
			</div>
		</main>
	)
}